src/cf/InformationRegisters/СубъектыОбращенияМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СубъектыОбращенияМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторСубъектаОбращения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СобственнаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноОбратноеАкцептование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОрганизацияКонтрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМестаДеятельности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектМестаДеятельностиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ОприходованиеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОприходованиеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияЗапасов</xr:Item>
				<xr:Item>Document.ПриходныйОрдер</xr:Item>
				<xr:Item>Document.ПриемИПередачаВРемонт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыВРазрезеГТД</xr:Item>
				<xr:Item>AccumulationRegister.СерииНоменклатурыКПоступлению</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыКПоступлениюНаСклады</xr:Item>
				<xr:Item>InformationRegister.ОперацииСПрослеживаемымиТоварами</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.СерииНоменклатуры</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>InformationRegister.СерииНоменклатурыГарантии</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерииНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_АвтоматическиФормироватьШтрихкодСерииПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ВводСерийПоПараметрам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ВсегдаФормироватьНовыеСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ЕстьМаркируемаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ЗапрашиватьШтрихкодСерииПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НеИспользоватьМаркировкуЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ПроверенНаФальсификаты</Name>
					<Comment>Признак проверки на наличие фальсификатов в табличной части</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьКладовщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеЯчейки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерииНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйКомплект</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ор_ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ор_СтатусЗаполненияУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ор_НомераУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКИЗ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РНПТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>26</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/СобытияФормМДЛПКлиентПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Возникает на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма записываемого объекта,
//  Отказ - Булево - признак отказа от записи,
//  ПараметрыЗаписи - Структура - структура, содержащая параметры записи.
//
Процедура ПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "РегистрСведений.СубъектыОбращенияМДЛП.Форма.ФормаЗаписи" Тогда
		
		Если Форма.Запись.СобственнаяОрганизация И Не ЗначениеЗаполнено(Форма.Запись.МестоДеятельности) Тогда
			ТекстСообщения = НСтр("ru = 'Место деятельности не заполнено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "МестоДеятельности", "Запись", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается во всех созданных формах при вызове метода Оповестить.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - оповещаемая форма,
//  ИмяСобытия - Строка - имя события,
//  Параметр - Произвольный - параметр сообщения. Могут быть переданы любые необходимые данные,
//  Источник - Произвольный - источник события.
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "Документ.УведомлениеОПриемкеМДЛП.Форма.ФормаДокумента" Тогда
		
		Если ИмяСобытия = "ВыполненоСопоставлениеЗаполнениеМДЛП" И Параметр = Форма.Объект.Ссылка Тогда
			Форма.Прочитать();
			Форма.ОбновитьСтатусУведомленияЭкспорт();
		КонецЕсли;
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Выполняет действия при изменении номенклатуры в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииНоменклатуры(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	Если НЕ ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(ТекущаяСтрока.Номенклатура) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранной номенклатуры не ведется учет маркируемых товаров.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитыНоменклатуры(ТекущаяСтрока);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении характеристики в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииХарактеристики(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	Если НЕ ПараметрыЗаполнения.Свойство("ЛюбаяХарактеристика") И НЕ ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(ТекущаяСтрока.Характеристика) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранной характеристики не ведется учет маркируемых товаров.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении серии в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииСерии(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	
	
КонецПроцедуры

// Выполняет действия при изменении упаковки в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииУпаковки(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении количества упаковок в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииКоличестваУпаковок(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении количества в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииКоличества(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении цены в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииЦены(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении суммы в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииСуммы(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при начале выбора номенклатуры в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  Элемент - ПолеВвода - элемент формы Характеристика,
//  ДанныеВыбора - СписокЗначений - в обработчике можно сформировать и передать в этом параметре данные для выбора,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура НачалоВыбораНоменклатуры(Форма, ТекущаяСтрока, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполняет действия при начале выбора характеристики в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  Элемент - ПолеВвода - элемент формы Характеристика,
//  ДанныеВыбора - СписокЗначений - в обработчике можно сформировать и передать в этом параметре данные для выбора,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура НачалоВыбораХарактеристики(Форма, ТекущаяСтрока, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент <> Неопределено
		И (Элемент.Имя = "СоставТранспортныхУпаковокХарактеристика"
		ИЛИ Элемент.Имя = "ТоварыХарактеристика") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("Отбор", Новый Структура("Владелец", ТекущаяСтрока.Номенклатура));
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора, Элемент, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет действия при начале выбора серии в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров;
//  ПараметрыУказанияСерий - Структура - параметры указания серий, возвращаемые соответствующей
//         процедурой модуля менеджера документа;
//  Элемент - ПолеВвода - элемент формы Характеристика;
//  ДанныеВыбора - СписокЗначений - в обработчике можно сформировать и передать в этом параметре данные для выбора;
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура НачалоВыбораСерии(ЭтотОбъект, ТекущаяСтрока, ПараметрыУказанияСерий, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполняет действия при начале выбора упаковки в таблице Товары.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  Элемент - ПолеВвода - элемент формы Упаковка,
//  ДанныеВыбора - СписокЗначений - в обработчике можно сформировать и передать в этом параметре данные для выбора,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура НачалоВыбораУпаковки(Форма, ТекущаяСтрока, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	// +ор интеграция МДЛП
	//ОбработкаТабличнойЧастиТоварыКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, ТекущаяСтрока);
	// -ор интеграция МДЛП
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик переопределяемой команды формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта справочника или документа,
//  Команда - КомандаФормы - команда формы.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиент.ВыполнитьКомандуЗарегистрироватьGTIN(Форма, Команда);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Открывает форму создания нового документа поступления товаров на основании уведомления о приемке.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызывается команда создания документа. Для автоматической подстановки
//         создаваемого документа в поле "Основание", форма должна быть передана в качестве владельца открываемой формы;
//  Ссылка - ДокументСсылка.Уведомление - ссылка на уведомление о поступлении.
//
Процедура ОткрытьФормуСозданияДокументаПоступленияТоваровНаОсновании(Форма, Ссылка) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "Документ.УведомлениеОПриемкеМДЛП.Форма.ФормаДокумента" Тогда
		
		Если Форма.Объект.Операция = ПредопределенноеЗначение("Перечисление.ОперацииПриемкиМДЛП.Поступление")
			ИЛИ Форма.Объект.Операция = ПредопределенноеЗначение("Перечисление.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора")
			ИЛИ Форма.Объект.Операция = ПредопределенноеЗначение("Перечисление.ОперацииПриемкиМДЛП.ВозвратОтПокупателя") Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Основание", Ссылка);
			Форма.ОжидаетсяЗаписьДокументаОсновния = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ОформлениеДокументаОснованияЗавершение", Форма);
			ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы, Форма);
		КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Документ.УведомлениеОбОприходованииМДЛП.Форма.ФормаДокумента" Тогда
		
		Если Форма.Объект.Операция = ПредопределенноеЗначение("Перечисление.ОперацииОприходованияМДЛП.Пересорт") Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Основание", Ссылка);
			Форма.ОжидаетсяЗаписьДокументаОсновния = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ОформлениеДокументаОснованияЗавершение", Форма);
			ОткрытьФорму("Документ.ОприходованиеЗапасов.Форма.ФормаДокумента", ПараметрыФормы, Форма);
		КонецЕсли;
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Открывает форму выбора документа поступления товаров.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызывается команда выбора документа;
//  Объект - ДокументОбъект.Уведомление - уведомление для которого подбирается поступление;
//  ОповещениеПриЗавершении - ОписаниеОповещения - процедура, вызываемая после закрытия формы выбора;
//
Процедура ОткрытьФормуВыбораДокументаПоступлениеТоваров(Форма, Объект, ОповещениеПриЗавершении) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "Документ.УведомлениеОПеремещенииМДЛП.Форма.ФормаДокумента" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерДокумента"                  , Объект.НомерДокумента);
		СтруктураПараметров.Вставить("ДатаДокумента"                   , Объект.ДатаДокумента);
		СтруктураПараметров.Вставить("ОрганизацияМДЛП"                 , Объект.Организация);
		СтруктураПараметров.Вставить("МестоДеятельностиМДЛП"           , Объект.МестоДеятельности);
		СтруктураПараметров.Вставить("МестоДеятельностиПолучательМДЛП" , Объект.МестоДеятельностиПолучатель);
		СтруктураПараметров.Вставить("ЭтоОрдер"                        , Ложь);
		
		МассивДокументов = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораДляСвязыванияУведомленияОПеремещенииТоваров(СтруктураПараметров);
		
		ПараметрыОтбор = Новый Структура("Ссылка", МассивДокументов);
		ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбор);
		
		ОткрытьФорму("Документ.ПеремещениеЗапасов.ФормаВыбора",
			ПараметрыФормы,
			Форма,
			,
			,
			,
			ОповещениеПриЗавершении,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Форма.ИмяФормы = "Документ.УведомлениеОбОприходованииМДЛП.Форма.ФормаДокумента" Тогда
		
		Если Форма.Объект.Операция = ПредопределенноеЗначение("Перечисление.ОперацииОприходованияМДЛП.Пересорт") Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ОрганизацияМДЛП"      , Объект.Организация);
			СтруктураПараметров.Вставить("МестоДеятельностиМДЛП", Объект.МестоДеятельности);
			
			МассивДокументов = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораДляСвязыванияУведомленияОбОприходованииМДЛП(СтруктураПараметров);
			
			ПараметрыОтбор = Новый Структура("Ссылка", МассивДокументов);
			ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбор);
			
			ОткрытьФорму("Документ.ОприходованиеЗапасов.ФормаВыбора",
				ПараметрыФормы,
				Форма,
				,
				,
				,
				ОповещениеПриЗавершении,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Открывает форму выбора документа выбытия товаров.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызывается команда выбора документа;
//  Объект - ДокументОбъект.Уведомление - уведомление для которого подбирается документ выбытия;
//  ОповещениеПриЗавершении - ОписаниеОповещения - процедура, вызываемая после закрытия формы выбора;
//
Процедура ОткрытьФормуВыбораДокументаВыбытияТоваров(Форма, Объект, ОповещениеПриЗавершении) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "Документ.УведомлениеОВыбытииМДЛП.Форма.ФормаДокумента" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОрганизацияМДЛП"      , Объект.Организация);
		СтруктураПараметров.Вставить("МестоДеятельностиМДЛП", Объект.МестоДеятельности);
		СтруктураПараметров.Вставить("Операция"             , Объект.Операция);
		СтруктураПараметров.Вставить("ТипВыводаИзОборота"   , Объект.ТипВыводаИзОборота);
		
		МассивДокументов = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораДляСвязыванияУведомленияОВыбытииТоваров(СтруктураПараметров);
		
		ПараметрыОтбор = Новый Структура("Ссылка", МассивДокументов);
		ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбор);
		
		ОткрытьФорму("Документ.СписаниеЗапасов.ФормаВыбора",
			ПараметрыФормы,
			Форма,
			,
			,
			,
			ОповещениеПриЗавершении,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Форма.ИмяФормы = "Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.Форма.ФормаДокумента" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОрганизацияМДЛП"      , Объект.Организация);
		СтруктураПараметров.Вставить("МестоДеятельностиМДЛП", Объект.МестоДеятельности);
		
		МассивДокументов = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораДляСвязыванияУведомленияОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП(СтруктураПараметров);
		
		ПараметрыОтбор = Новый Структура("Ссылка", МассивДокументов);
		ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбор);
		
		ОткрытьФорму("Документ.РасходнаяНакладная.ФормаВыбора",
			ПараметрыФормы,
			Форма,
			,
			,
			,
			ОповещениеПриЗавершении,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Открывает форму создания нового документа инвентаризация товаров на основании инвентаризации МДЛП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызывается команда создания документа. Для автоматической подстановки
//         создаваемого документа в поле "Основание", форма должна быть передана в качестве владельца открываемой формы;
//  Ссылка - ДокументСсылка - ссылка на документ МДЛП.
//
Процедура ОткрытьФормуСозданияДокументаИнвентаризацияТоваровНаОсновании(Форма, Ссылка) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "Документ.ИнвентаризацияПотребительскихУпаковокМДЛП.Форма.ФормаДокумента" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", Ссылка);
		Форма.ОжидаетсяЗаписьДокументаОсновния = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОформлениеДокументаОснованияЗавершение", Форма);
		ОткрытьФорму("Документ.ИнвентаризацияЗапасов.Форма.ФормаДокумента", ПараметрыФормы, Форма);
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Открывает форму выбора документа инвентаризация товаров.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызывается команда выбора документа;
//  Объект - ДокументОбъект - документ-объект МДЛП для которого подбирается инвентаризация;
//  ОповещениеПриЗавершении - ОписаниеОповещения - процедура, вызываемая после закрытия формы выбора;
//
Процедура ОткрытьФормуВыбораДокументаИнвентаризацияТоваров(Форма, Объект, ОповещениеПриЗавершении) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "Документ.ИнвентаризацияПотребительскихУпаковокМДЛП.Форма.ФормаДокумента" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОрганизацияМДЛП"      , Объект.Организация);
		СтруктураПараметров.Вставить("МестоДеятельностиМДЛП", Объект.МестоДеятельности);
		СтруктураПараметров.Вставить("ИнвентаризационнаяОпись", Объект.ИнвентаризационнаяОпись);
		
		МассивДокументов = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораДляСвязыванияИнвентаризацияПотребительскихУпаковокМДЛП(СтруктураПараметров);
		
		ПараметрыОтбор = Новый Структура("Ссылка", МассивДокументов);
		ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбор);
		
		ОткрытьФорму("Документ.ИнвентаризацияЗапасов.ФормаВыбора",
			ПараметрыФормы,
			Форма,
			,
			,
			,
			ОповещениеПриЗавершении,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Открывает форму создания нового документа инвентаризационная опись товаров на основании инвентаризации МДЛП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызывается команда создания документа. Для автоматической подстановки
//         создаваемого документа в поле "Основание", форма должна быть передана в качестве владельца открываемой формы;
//  Ссылка - ДокументСсылка - ссылка на документ МДЛП.
//
Процедура ОткрытьФормуСозданияДокументаИнвентаризационнаяОписьТоваровНаОсновании(Форма, Ссылка) Экспорт
	
	
	
КонецПроцедуры

// Открывает форму выбора документа инвентаризационная опись товаров.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызывается команда выбора документа;
//  Объект - ДокументОбъект - документ-объект МДЛП для которого подбирается инвентаризационная опись;
//  ОповещениеПриЗавершении - ОписаниеОповещения - процедура, вызываемая после закрытия формы выбора;
//
Процедура ОткрытьФормуВыбораДокументаИнвентаризационнаяОписьТоваров(Форма, Объект, ОповещениеПриЗавершении) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодированиеНоменклатуры

// В функции нужно реализовать подготовку данных для дальнейшей обработки штрихкодов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка,
//  ДанныеШтрихкодовПоТипам - Структура
//     * НомераКиЗ - Массив - разобранные данные штрихкодов вторичных упаковок;
//     * НомераТранспортныхУпаковок - Массив - разобранные данные штрихкодов транспортных упаковок;
//     * НеизвестныеШтрихкоды - Массив - полученные данные прочих штрихкодов.
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ,
//  ПараметрыЗаполнения - Структура - параметры заполнения (см. ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти()).
//  ОтборСтрок - Структура - отбор строк списков товары и транспортные упаковки, для заполения по штрихкодам.
//
// Возвращаемое значение:
//  Структура - подготовленные данные.
//
Функция ПодготовитьДанныеДляОбработкиШтрихкодов(Форма, ДанныеШтрихкодовПоТипам, КэшированныеЗначения, ПараметрыЗаполнения, ОтборСтрок = Неопределено) Экспорт
	
	
	
КонецФункции

// Вызывается после загрузки данных по штрихкодам.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
//
Процедура ПослеОбработкиШтрихкодов(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	
КонецПроцедуры

// Требуется реализовать получение данных связанной номенклатуры.
//
// Параметры:
//  Данные - Структура - 
//    * Штрихкод - Строка - представление исходного штрихкода;
//    * GTIN - Строка - код товара;
//    * SGTIN - Строка - уникальный код упаковки;
// 
// Возвращаемое значение:
//   - Структура
//      * Номенклатура
//      * Характеристика
//      * Упаковка
//
Функция ПолучитьДанныеНоменклатурыПоКиЗ(Данные) Экспорт
	
	// +ор интеграция МДЛП
	СтруктураВозврата = Новый Структура();
	
	НайденнаяВСправочнике = ор_ИнтеграцияМДЛП.НайтиНоменклатуруПоНомеруИКлючуУпаковки(Данные);
	Если НайденнаяВСправочнике <> Неопределено Тогда
		
		СтруктураВозврата.Вставить("Номенклатура", НайденнаяВСправочнике.Номенклатура);
		Если ЗначениеЗаполнено(НайденнаяВСправочнике.Характеристика) Тогда
			СтруктураВозврата.Вставить("Характеристика",НайденнаяВСправочнике.Характеристика);
		КонецЕсли;
		
		СтруктураВозврата.Вставить("Упаковка");
		ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитыНоменклатуры(СтруктураВозврата);
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Номенклатура = ор_ИнтеграцияМДЛП.НайтиНоменклатруПоGTIN(Данные.GTIN);
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		СтруктураВозврата.Вставить("Номенклатура", Номенклатура);
		
		Характеристика = ор_ИнтеграцияМДЛП.НайтиХарактеристикуПоСерииИСроку(Номенклатура, Данные);
		Если ЗначениеЗаполнено(Характеристика) Тогда
			СтруктураВозврата.Вставить("Характеристика", Характеристика);
		КонецЕсли;
		
		СтруктураВозврата.Вставить("Упаковка");
		ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитыНоменклатуры(СтруктураВозврата);
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	// -ор интеграция МДЛП
	
КонецФункции

#КонецОбласти

#Область ЗапросИнформацииОбУпаковках

// В процедуре можно переопределить стандартный алгоритм запроса информации о потребительских упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  ПараметрыПодключения - Структура - параметры подключения к ИС "Маркировка.МДЛП".
//  НомераУпаковок - Массив - запрашиваемые номера упаковок.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ЗапроситьИнформациюОПотребительскихУпаковках(Форма, ПараметрыПодключения, НомераУпаковок, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// В процедуре можно переопределить стандартный алгоритм обработки получения информации о потребительских упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  Результат - Структура - результат функции ТранспортМДЛПАПИКлиентСервер.ПолучитьИнформациюОПотребительскихУпаковках.
//  Контекст - Структура - дополнительные параметры, переданные из функции ЗапроситьИнформациюОПотребительскихУпаковках формы документа.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ОбработатьПолучениеИнформацииОПотребительскихУпаковках(Форма, Результат, Контекст, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// В процедуре можно переопределить стандартный алгоритм запроса информации о транспортных упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  ПараметрыПодключения - Структура - параметры подключения к ИС "Маркировка.МДЛП".
//  НомераУпаковок - Массив - запрашиваемые номера упаковок.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ЗапроситьИнформациюОТранспортныхУпаковках(Форма, ПараметрыПодключения, НомераУпаковок, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// В процедуре можно переопределить стандартный алгоритм обработки получения информации о транспортных упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  Результат - Структура - результат функции ТранспортМДЛПАПИКлиентСервер.ПолучитьИнформациюОТранспортныхУпаковках.
//  Контекст - Структура - дополнительные параметры, переданные из функции ЗапроситьИнформациюОПотребительскихУпаковках формы документа.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ОбработатьПолучениеИнформацииОТранспортныхУпаковках(Форма, Результат, Контекст, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
